#Область СлужебныеПроцедурыИФункции

&Вместо("МенеджерОбъектаПоСсылке")
Функция ЭП_МенеджерОбъектаПоСсылке(Ссылка)
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	МетаданныеРасширения = ПолучитьМетаданныеТекущегоРасширения();
	МетаданныеТипа = МетаданныеРасширения.НайтиПоТипу(ТипСсылки);
    
    Если МетаданныеТипа <> Неопределено И МетаданныеРасширения.Справочники.Содержит(МетаданныеТипа) Тогда
		Возврат Справочники[ИмяОбъекта];
    КонецЕсли;

	Результат = ПродолжитьВызов(Ссылка);
	Возврат Результат;

КонецФункции

Функция ПолучитьМетаданныеТекущегоРасширения() Экспорт
    
    МассивРасширений = РасширенияКонфигурации.Получить();
    
    Для Каждого Расширение Из МассивРасширений Цикл
        МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(Расширение.ПолучитьДанные());
        Если МетаданныеРасширения.Имя = "ЭкспрессПроверка" Тогда
            Возврат МетаданныеРасширения;
        КонецЕсли;
    КонецЦикла;
    Возврат Неопределено;

КонецФункции // ПолучитьМетаданныеТекущегоРасширения()

#КонецОбласти
