#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//	Настройки - ТаблицаЗначений - Передается "как есть" из ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//	ОписаниеОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//		уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт

	НастройкиВарианта	= ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.Включен = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецЕсли